In [2]:
mes=4

In [10]:
%run -i funcs_armazem.py
%matplotlib inline

WARNING *** file size (265753) not 512 + multiple of sector size (512)
WARNING *** OLE2 inconsistency: SSCS size is 0 but SSAT size is non-zero
WARNING *** file size (37433) not 512 + multiple of sector size (512)
WARNING *** OLE2 inconsistency: SSCS size is 0 but SSAT size is non-zero
WARNING *** file size (671597) not 512 + multiple of sector size (512)
WARNING *** OLE2 inconsistency: SSCS size is 0 but SSAT size is non-zero
WARNING *** file size (289760) not 512 + multiple of sector size (512)
WARNING *** OLE2 inconsistency: SSCS size is 0 but SSAT size is non-zero
WARNING *** file size (289760) not 512 + multiple of sector size (512)
WARNING *** OLE2 inconsistency: SSCS size is 0 but SSAT size is non-zero
WARNING *** file size (289760) not 512 + multiple of sector size (512)
WARNING *** OLE2 inconsistency: SSCS size is 0 but SSAT size is non-zero
WARNING *** file size (231043) not 512 + multiple of sector size (512)
WARNING *** OLE2 inconsistency: SSCS size is 0 but SSAT size is non-zero
WARNING *** file size (231043) not 512 + multiple of sector size (512)
WARNING *** OLE2 inconsistency: SSCS size is 0 but SSAT size is non-zero

In [34]:
# tcv_by_cia_mes['ACUM'] = tcv_by_cia_mes.sum(1)
# tcv_by_cia_mes.loc['TOTAL'] = tcv_by_cia_mes.sum()
# tcv_by_cia_mes
# meta_tcv = metas_by_cia_indicador_mes.xs('TCV', level=1)
# meta_tcv['ACUM'] = meta_tcv.sum(1)
# meta_tcv.loc['TOTAL'] = meta_tcv.sum()
# meta_tcv

MES         1     2     3     4    ACUM
23_CIA
139 CIA    28    29    26    27    2530
142 CIA    50    45    27    26    3404
51 CIA     30    21    23    19    2139
53 CIA     25    14    11     6    1288
TOTAL    2660  2180  1740  1560  187220

In [250]:
metas = pd.read_sql_table('tbl_metas', 'sqlite:///gdo.db')
metas.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 540 entries, 0 to 539
Data columns (total 4 columns):
MES          540 non-null int64
META         540 non-null float64
CIA          540 non-null object
INDICADOR    540 non-null object
dtypes: float64(1), int64(1), object(2)
memory usage: 17.0+ KB

In [195]:
metas[
    ( metas['CIA'] == '53 CIA' )
    & (metas['INDICADOR'] == 'THC')
]['META']

84    0.964844
85    0.000000
86    0.964844
87    0.964844
88    0.964844
89    0.000000
90    0.000000
91    0.000000
92    0.000000
93    0.000000
94    0.964844
95    0.000000
Name: META, dtype: float16

In [215]:
# metas = pd.read_csv('files/metas.csv', dtype={'META':'float16'}, decimal=',')
# metas.to_sql('tbl_metas', 'sqlite:///gdo.db', index=False, if_exists='replace')

In [224]:
# 53ª Cia PM	69.242
# 139ª Cia PM	102.919
# 142ª Cia PM	129.575
# 51ª Cia PM	104.360

pops = pd.DataFrame({
    'CIA':['53 CIA', '139 CIA', '142 CIA', '51 CIA'],
    'POPULACAO':[69242,102919,129575,104360]
})
pops.to_sql('tbl_populacoes', 'sqlite:///gdo.db', index=False)

In [221]:
np.iinfo('uint32')

iinfo(min=0, max=4294967295, dtype=uint32)